<div class="modal fade" id="flowersRules" tabindex="-1" role="dialog" aria-labelledby="exampleModalLabel"
     aria-hidden="true">
    <div class="modal-dialog modal-lg" role="document">
        <div class="modal-content ">
            <div class="modal-header">
                <h5 class="modal-title" id="exampleModalLabel">Условия покупки</h5>
                <button type="button" class="close" data-dismiss="modal" aria-label="Close">
                    <span aria-hidden="true">&times;</span>
                </button>
            </div>
            <div class="modal-body">
                <div>
                    <ul>


                        <li> Класс, что вам нравятся наши букеты, и мы готовы доставить их в удобное для вас
                            время, но обрабатываем ваши заказы мы в рабочее время: с 11.00 до 21.00. Если вам
                            необходима доставка раньше - позвоните нам.
                        </li>
                        <li> Мы привезем ваш букет, собранный нашими ручками, с любовью и хорошим настроением.
                            Но хоть мы и находимся в самом центре столицы - пробки никто не отменял, поэтому
                            указывайте интервал времени доставки, например - с 11.00-13.00.
                        </li>
                        <li> Мы работаем только со свежими цветами. Поставки у нас ежедневные, но если нам
                            необходим определенный цветок, а он не прошел наш контроль при отборе на закупке -
                            мы покупаем стилистически похожий (он может отличаться оттенком). Общий вид,
                            характер и стойкость букета остаются неизменными. Каждый наш букет - уникален.
                        </li>
                        <li> Мы осуществляем доставку только по Москве и Московской Области.</li>
                        <li> Заказ может быть отменён в любое время до его передачи.</li>
                        <li> Деньги за отмененный заказ или заказ ненадлежащего качества могут быть возращены
                            тем же способом, которым была произведена оплата: на карту, расчетный счет,
                            курьером.
                        </li>
                    </ul>
                </div>
            </div>
        </div>
    </div>
</div>

<div class="modal fade" id="personalRules" tabindex="-1" role="dialog" aria-labelledby="exampleModalLabel"
     aria-hidden="true">
    <div class="modal-dialog modal-lg" role="document">
        <div class="modal-content ">
            <div class="modal-header">
                <h5 class="modal-title" id="exampleModalLabel">Условия покупки</h5>
                <button type="button" class="close" data-dismiss="modal" aria-label="Close">
                    <span aria-hidden="true">&times;</span>
                </button>
            </div>
            <div class="modal-body">
                <div>
                    Условия хранения персональных
                    данных<br><br>1.
                    Общие положения<br>1.1. Настоящая Политика обработки персональных данных (далее – Политика),
                    принятая
                    ООО
                    «ВайтСтудио» (ИНН 7715684464, юридический адрес: 115184 г. Москва, Большой Ордынский переулок д.
                    4 стр.
                    7 )
                    (далее – Вайт Студиос), определяет основные принципы, цели, порядок и условия обработки
                    персональных
                    данных
                    Посетителей сайта, меры по обеспечению безопасности и защиты персональных данных.<br><br>1.2.
                    Настоящая
                    Политика
                    разработана в соответствии с требованиями Конституции Российской Федерации, законодательных и
                    иных
                    нормативных
                    правовых актов Российской Федерации в области персональных данных и опубликована для
                    неограниченного
                    доступа
                    на
                    сайте Вайт Студиос по адресу: whitestudios.ru <br>1.3. Используемые в настоящей Политике понятия
                    толкуются
                    согласно их определению в Федеральном законе РФ от 27.07.2006 г. № 152-ФЗ «О персональных
                    данных».<br><br>1.4.
                    Вайт Студиос гарантирует соблюдение конфиденциальности в отношении полученных персональных
                    данных с
                    учетом
                    положений настоящей Политики и обязуется использовать их только в целях, указанных в Политике.
                    <br>2.
                    Понятие и
                    состав персональных данных<br>2.1. Перечень персональных данных, подлежащих защите в Вайт
                    Студиос,
                    формируется в
                    соответствии с Федеральным законом РФ от 27 июля 2006 г. № 152-ФЗ «О персональных
                    данных».<br><br>2.2.
                    Вайт
                    Студиос производит обработку и защиту персональных данных Посетителей Сайта Вайт Студиос
                    whitestudios.ru
                    (далее
                    – Сайт), а также персональных данных, поступающих на адрес корпоративной почты Вайт Студиос,
                    заканчивающейся
                    на
                    @whitestudios.ru (далее – Корпоративная почта), субъектов, которые выразили Согласие на
                    обработку
                    персональных
                    данных (далее – Согласие) путем отправления информации через выбранные формы (далее – Формы) на
                    страницах
                    Сайта
                    или отправления электронного письма. Моментом принятия Согласия является маркировка
                    соответствующего
                    поля в
                    Форме и нажатие на кнопку отправки Формы на любой странице Сайта, а также нажатие на кнопку
                    отправки
                    электронного письма, содержащего персональные данные субъекта, на адрес Корпоративной почты.<br><br>2.3.
                    Во
                    время просмотра Сайта Вайт Студиос, чтения текстов и загрузки иной информации, происходит
                    автоматическая
                    регистрация определенных данных о компьютере, с которого Посетитель Сайта просматривает Сайт
                    Вайт
                    Студиос.
                    При
                    просмотре Сайта Вайт Студиос собирает следующую информацию: <br>• дату и время посещения Сайта;
                    <br>•
                    число
                    посещенных страниц, их названия, а также длительность просмотра; <br>• IP-адрес, присвоенный
                    устройству
                    для
                    выхода в Интернет; <br>• тип браузера и операционной системы; <br>• URL сайта, с которого был
                    осуществлен
                    переход. <br>3. Цели обработки персональных данных<br>3.1. Обработка персональных данных
                    Посетителей
                    Сайта
                    осуществляется в таких целях, как: <br>• направление Посетителям Сайта справочной и
                    маркетинговой
                    информации,
                    посредством направления сообщений на адрес электронной почты, указанной Посетителями Сайта; <br>•
                    предоставление
                    Посетителям возможности для обратной связи с Вайт Студиос; <br>• предоставление Посетителям
                    Сайта
                    консультаций
                    по вопросам, касающимся реализуемых товаров, в целях маркетинговой деятельности и поддержки
                    Посетителей
                    Сайта, а
                    также в иных целях, не противоречащих действующему законодательству Российской Федерации и
                    условиям
                    соглашений
                    между Вайт Студиос и соответствующими посетителями Сайта. <br>4. Принципы и условия обработки
                    персональных
                    данных<br>4.1. Обработка персональных данных Вайт Студиос основывается на следующих принципах:
                    <br>•
                    законности
                    и справедливой основы; <br>• ограничением достижения конкретных, заранее определенных и законных
                    целей;
                    <br>•
                    недопущением обработки персональных данных, несовместимой с целями сбора персональных данных;
                    <br>•
                    недопущением
                    объединения баз данных, содержащих персональные данные, обработка которых осуществляется в
                    целях,
                    несовместимых
                    между собой; <br>• содержание и объем обрабатываемых персональных данных должны соответствовать
                    заявленным
                    целям
                    обработки; <br>• хранение персональных данных осуществляется в форме, позволяющей определить
                    субъекта
                    персональных данных, не дольше, чем этого требуют цели обработки персональных данных, если срок
                    хранения
                    персональных данных не установлен федеральным законом, договором, стороной которого,
                    выгодоприобретателем
                    или
                    поручителем по которому является субъект персональных данных; <br>• иных принципов,
                    предусмотренных
                    действующим
                    законодательством Российской Федерации о персональных данных.<br><br>4.2. Вайт Студиос
                    производит
                    обработку
                    персональных данных при наличии хотя бы одного из условий: <br>• субъект персональных данных дал
                    Согласие на
                    обработку персональных данных; <br>• обработка персональных данных необходима для осуществления
                    прав и
                    законных
                    интересов Вайт Студиос для достижения общественно значимых целей при условии, что при этом не
                    нарушаются
                    права и
                    свободы субъекта персональных данных; <br>• обработка персональных данных осуществляется в
                    статистических
                    или
                    иных исследовательских целях, при условии обязательного обезличивания персональных данных; <br>•
                    иных
                    условий,
                    предусмотренных действующим законодательством Российской Федерации о персональных данных. <br>5.
                    Права и
                    обязанности субъекта персональных данных<br>5.1. Субъект персональных данных имеет право: <br>•
                    требовать
                    уточнения своих персональных данных, их обновления, блокирования или уничтожения; <br>• получать
                    перечень
                    своих
                    персональных данных, обрабатываемых Вайт Студиос, источник их получения, информацию о сроках
                    обработки
                    своих
                    персональных данных, в том числе о сроках их хранения, и иные сведения об обработке своих
                    персональных
                    данных;
                    <br>• требовать уведомления всех лиц, которым ранее были сообщены его неверные или неполные
                    персональные
                    данные,
                    обо всех произведенных исправлениях или дополнениях; <br>• обжаловать в установленном порядке
                    неправомерные
                    действия или бездействия при обработке его персональных данных.<br><br>5.2. Посетители Сайта
                    обязуются
                    предоставлять только достоверные данные о себе.<br><br>5.3. Согласие на обработку персональных
                    данных
                    выдается
                    Посетителем на весь срок, необходимый Вайт Студиос для достижения целей обработки.<br><br>5.4.
                    Согласие
                    на
                    обработку персональных данных может быть отозвано Посетителем путем направления письменного
                    заявления по
                    адресу
                    Вайт Студиос: 119361 г. Москва, улица Очаковская Б., д. 47А, стр. 1, офис 237 или на адрес
                    Корпоративной
                    почты
                    (info@whitestudios.ru).<br><br>5.5. Лица, передавшие сведения в Вайт Студиос через Сайт о другом
                    субъекте
                    персональных данных, не имея при этом согласия субъекта, чьи персональные данные были переданы,
                    несут
                    ответственность в соответствии с законодательством Российской Федерации. <br>6. Права и
                    обязанности Вайт
                    Студиос<br>6.1.
                    Вайт Студиос никогда не запрашивает у Посетителя Сайта сведения о его расовой, национальной
                    принадлежности,
                    политических взглядах, религиозных и философских убеждениях, состоянии здоровья, интимной жизни.
                    <br><br>6.2.
                    В
                    ходе обработки персональных данных Вайт Студиос вправе осуществлять: сбор, запись,
                    систематизацию,
                    накопление,
                    хранение, уточнение (обновление, изменение), извлечение, использование, передачу
                    (распространение,
                    предоставление, доступ), обезличивание, блокирование, удаление, уничтожение персональных данных
                    Посетителя.<br><br>6.3. В случае участия Посетителей в мероприятиях, организуемых Вайт Студиос,
                    последний
                    вправе
                    раскрыть соответствующие персональные данные Посетителей лицам, участвующим в организации такого
                    мероприятия.<br><br>6.4. Вайт Студиос не вправе передавать персональные данные Посетителей Сайта
                    третьей
                    стороне
                    за исключением следующих лиц: <br>• уполномоченных государственных органов в рамках их
                    полномочий; <br>•
                    лиц,
                    которым Вайт Студиос обязана их передать в целях соблюдения законодательства РФ; <br>• лиц,
                    которым Вайт
                    Студиос
                    передает персональные данные в целях исполнения договора с субъектом персональных данных; <br>•
                    лиц,
                    которым
                    Вайт Студиос поручает обработку персональных данных; <br>• правопреемникам Вайт Студиос при его
                    реорганизации;
                    <br>• иных лиц, с согласия субъекта персональных данных. <br>6.5. Вайт Студиос не вправе
                    сообщать
                    персональные
                    данные Посетителя Сайта в коммерческих целях без его согласия. Обработка персональных данных
                    Посетителя
                    в
                    целях
                    продвижения товаров, работ, услуг на рынке путем осуществления прямых контактов с потенциальным
                    потребителем
                    с
                    помощью средств связи допускается только с предварительного согласия Посетителя.<br><br>6.6.
                    Вайт
                    Студиос
                    обязуется предупредить лиц, получивших персональные данные Посетителя, о том, что эти данные
                    могут быть
                    использованы лишь в целях, для которых они сообщены, и требовать от этих лиц подтверждение того,
                    что это
                    правило
                    соблюдено.<br><br>6.7. Лица, получившие персональные данные Посетителя, обязаны соблюдать режим
                    секретности
                    (конфиденциальности).<br><br>6.8. Вайт Студиос обрабатывает и проводит мероприятия по защите
                    персональных
                    данных
                    Посетителей Сайта в соответствии с положениями настоящей Политики, а также иных документов,
                    изданных в
                    Вайт
                    Студиос. <br>7. Обеспечение защиты и безопасности персональных данных<br>7.1. Вайт Студиос
                    применяет
                    соответствующие стандарты технологической и операционной безопасности для защиты информации,
                    предоставляемой
                    Посетителями Сайта, от несанкционированного доступа, раскрытия, искажения, блокирования или
                    уничтожения.<br><br>7.2.
                    К мерам, применяемым в Вайт Студиос относятся: <br>• назначение ответственного лица за
                    организацию
                    обработки
                    персональных данных; <br>• применение правовых, технических и организационных мер по обеспечению
                    безопасности
                    персональных данных; <br>• оценке вреда, который может быть причинен субъектам персональных
                    данных в
                    случае
                    нарушения требований законодательства, соотношение вреда и принимаемых Вайт Студиос мер
                    безопасности;
                    <br>•
                    использование охраняемых помещений с разграниченным доступом для размещения серверов
                    информационных
                    систем
                    персональных данных, а также использование запираемых шкафов для хранения бумажных носителей
                    персональных
                    данных; <br>• ознакомление работников Вайт Студиос, непосредственно осуществляющих обработку
                    персональных
                    данных, с положениями законодательства РФ о персональных данных; <br>• контроль за принимаемыми
                    мерами
                    по
                    обеспечению безопасности персональных данных.<br>7.3. Доступ к персональным данным
                    предоставляется
                    только
                    уполномоченным сотрудникам Вайт Студиос, которые взяли на себя обязательство сохранять
                    конфиденциальность
                    такой
                    информации. <br>8. Хранение персональных данных<br>8.1. Персональные данные Посетителей Сайта
                    хранятся в
                    течение
                    периода, необходимого для целей, в которых такие данные были предоставлены или в течение
                    периода,
                    предусмотренного законодательством.<br><br>8.2. По достижению целей/истечения периода для
                    обработки
                    персональных
                    данных персональные данные Посетителей Сайта уничтожаются. <br>9. Информация журнала, технологии
                    «cookies» и
                    «web beacons»<br>9.1. Сайт Вайт Студиос производит сбор типовой информации журнала сеанса,
                    включая
                    IP-адрес,
                    тип
                    и язык обозревателя, а также данные о времени посещения и адресе веб-сайтов, с которых
                    осуществлялся
                    переход
                    по
                    ссылкам. С целью обеспечения эффективного управления Сайтом и содействия в настройке
                    пользовательского
                    интерфейса Вайт Студиос может использовать файлы cookies (небольшие по размеру текстовые файлы,
                    хранящиеся в
                    браузере посетителя) или web beacons (веб-маяки — электронные изображения) совместно с tracking
                    pixels
                    (пиксели
                    слежения), позволяющие Cайту производить подсчет количества посетителей, зашедших на
                    определенную
                    страницу,
                    и
                    обеспечивать доступ к определенным cookie-файлам. <br> <br>Собранная типовая информация
                    используется
                    исключительно в статистических целях. Вайт Студиос не использует персональные данные в целях
                    личной
                    идентификации кого-либо из Посетителей. Однако при авторизации зарегистрированных Посетителей на
                    Сайте
                    Вайт
                    Студиос может использовать данную информацию в сочетании со сведениями, получаемыми благодаря
                    средствам
                    анализа
                    данных и cookie-файлам для того, чтобы проанализировать, как посетители используют Сайт.<br><br>9.2.
                    Используя
                    Сайт, Посетитель дает свое согласие на то, чтобы Вайт Студиос мог загружать cookie-файлы на
                    устройство
                    Посетителя согласно описанным выше условиям.<br><br>9.3. Посетитель имеет возможность управлять
                    cookie-файлами,
                    обратившись в настройки браузера. В случае удаления cookie-файлов будут удалены все данные о
                    предпочтениях
                    Посетителя, включая предпочтение об отказе от использования cookie-файлов. В случае блокирования
                    cookie-файлов
                    изменения могут отразиться на пользовательском интерфейсе, и некоторые компоненты Сайта могут
                    стать
                    недоступными. <br>10. Заключительные положения<br>10.1. Настоящая Политика подлежит изменению
                    или
                    дополнению
                    в
                    случаях внесения соответствующих изменений или дополнений в действующее законодательство
                    Российской
                    Федерации о
                    персональных данных, а также может быть изменена в любое время по усмотрению Вайт Студиос.
                    Действующая
                    редакция
                    Политики в Вайт Студиос всегда доступна для просмотра неограниченным кругом лиц на сайте по
                    постоянному
                    адресу:
                    whitestudios.ru<br><br>10.2. Все отношения с участием Вайт Студиос, касающиеся обработки и
                    защиты
                    персональных
                    данных и не получившие непосредственного отражения в настоящей Политике, регулируются согласно
                    положениям
                    действующего законодательства Российской Федерации о персональных данных.<br><br>10.3. Контроль
                    за
                    исполнением
                    требований настоящей Политики осуществляется лицом, ответственным за организацию обработки
                    персональных
                    данных
                    Вайт Студиос. <br>
                </div>
            </div>
        </div>
    </div>
</div>

<script src="https://unpkg.com/imask"></script>
<script>
    let deliveryPriceInMKAD = <?=$deliveryPriceInMKAD?>;
    let deliveryPriceOutMKAD = <?=$deliveryPriceOutMKAD?>;
</script>
